In [17]:
import pandas as pd
import numpy as np

df = pd.read_csv('data/combined_data_1.txt.csv')

Index(['movieId', 'customerId', 'rating', 'date'], dtype='object')

In [19]:
df.dtypes

movieId        int64
customerId     int64
rating         int64
date          object
dtype: object

In [29]:
df[(df["customerId"] == 1851044) & (df["rating"] == 5)]

          movieId  customerId  rating        date
79232          28     1851044       5  2004-03-24
401021        111     1851044       5  2004-08-16
783221        191     1851044       5  2004-03-26
1630391       313     1851044       5  2004-03-24
1715075       329     1851044       5  2004-03-24
...           ...         ...     ...         ...
23252724     4356     1851044       5  2004-03-24
23456016     4389     1851044       5  2004-03-26
23569673     4402     1851044       5  2004-03-30
23750098     4432     1851044       5  2004-03-24
24003482     4488     1851044       5  2004-05-05

[80 rows x 4 columns]